; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v1 ?v13)
             (pred_3 ?v8 ?v11)
             (pred_1 ?v1 ?v11)
             (pred_12 ?v9 ?v1 )
	     (pred_8 ?v1)
             (pred_5 ?v5)
             (pred_9 ?v8)
             (pred_7 ?v11)
             (pred_2 ?v1)
             (pred_10 ?v8)
             (pred_11 ?v1)
             (pred_4 ))



(:action op_5
:parameters (?v4 ?v3 ?v6 ?v10)
:precondition (and (pred_5 ?v4) (pred_5 ?v3) (pred_9 ?v6) (pred_7 ?v10)
          (pred_6 ?v4 ?v3) (pred_3 ?v6 ?v10)
                   (pred_1 ?v3 ?v10) (pred_8 ?v4) 
                   (pred_2 ?v3) (pred_10 ?v6))
:effect (and  (pred_11 ?v3) (not (pred_2 ?v3))))


(:action op_3
:parameters (?v4 ?v7)
:precondition (and (pred_5 ?v4) (pred_5 ?v7)
               (pred_8 ?v4) (pred_6 ?v4 ?v7) (pred_11 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v4))))

(:action op_1
:parameters (?v4 ?v6)
:precondition (and (pred_5 ?v4) (pred_9 ?v6) 
                  (pred_8 ?v4) (pred_12 ?v6 ?v4) (pred_4 ))
:effect (and (pred_10 ?v6)
   (not (pred_12 ?v6 ?v4)) (not (pred_4 ))))


(:action op_4
:parameters (?v4 ?v12 ?v2)
:precondition (and (pred_5 ?v4) (pred_9 ?v12) (pred_9 ?v2)
                  (pred_8 ?v4) (pred_10 ?v2) (pred_12 ?v12 ?v4))
:effect (and (pred_10 ?v12) (pred_12 ?v2 ?v4)
        (not (pred_10 ?v2)) (not (pred_12 ?v12 ?v4))))

(:action op_2
:parameters (?v4 ?v6)
:precondition (and (pred_5 ?v4) (pred_9 ?v6) 
                  (pred_8 ?v4) (pred_10 ?v6))
:effect (and (pred_4 ) (pred_12 ?v6 ?v4) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_15 obj_19 obj_03 obj_02 obj_11 obj_17 obj_24 obj_04 obj_07 obj_27 obj_09 obj_25 obj_30 obj_26 obj_12 obj_32 obj_13 obj_06 obj_05 obj_01 obj_28 obj_10 obj_14 obj_20 obj_08
    obj_23 obj_22 obj_16
    obj_18 obj_21 obj_29 obj_31
    )

    (:init
       (pred_4)

       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_03)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_17)
       (pred_5 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_27)
       (pred_5 obj_09)
       (pred_5 obj_25)
       (pred_5 obj_30)
       (pred_5 obj_26)
       (pred_5 obj_12)
       (pred_5 obj_32)
       (pred_5 obj_13)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_01)
       (pred_5 obj_28)
       (pred_5 obj_10)
       (pred_5 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_7 obj_23)
       (pred_7 obj_22)
       (pred_7 obj_16)
       (pred_9 obj_18)
       (pred_9 obj_21)
       (pred_9 obj_29)
       (pred_9 obj_31)

       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_19 obj_24)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_02)
       (pred_6 obj_03 obj_19)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_11)
       (pred_6 obj_02 obj_03)
       (pred_6 obj_11 obj_27)
       (pred_6 obj_11 obj_02)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_17 obj_24)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_24 obj_25)
       (pred_6 obj_24 obj_04)
       (pred_6 obj_24 obj_19)
       (pred_6 obj_24 obj_17)
       (pred_6 obj_04 obj_30)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_24)
       (pred_6 obj_07 obj_26)
       (pred_6 obj_07 obj_27)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_27 obj_12)
       (pred_6 obj_27 obj_11)
       (pred_6 obj_27 obj_07)
       (pred_6 obj_09 obj_32)
       (pred_6 obj_09 obj_25)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_25 obj_13)
       (pred_6 obj_25 obj_30)
       (pred_6 obj_25 obj_24)
       (pred_6 obj_25 obj_09)
       (pred_6 obj_30 obj_06)
       (pred_6 obj_30 obj_26)
       (pred_6 obj_30 obj_04)
       (pred_6 obj_30 obj_25)
       (pred_6 obj_26 obj_05)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_26 obj_07)
       (pred_6 obj_26 obj_30)
       (pred_6 obj_12 obj_01)
       (pred_6 obj_12 obj_27)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_32 obj_28)
       (pred_6 obj_32 obj_13)
       (pred_6 obj_32 obj_09)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_25)
       (pred_6 obj_13 obj_32)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_30)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_26)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_12)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_28 obj_10)
       (pred_6 obj_28 obj_32)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_10 obj_28)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_20 obj_08)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_08 obj_20)
       (pred_2 obj_30)
       (pred_2 obj_01)
       (pred_2 obj_27)
       (pred_2 obj_25)
       (pred_1  obj_30 obj_23)
       (pred_1  obj_01 obj_22)
       (pred_1  obj_27 obj_16)
       (pred_1  obj_25 obj_22)
       (pred_11 obj_15)
       (pred_11 obj_19)
       (pred_11 obj_03)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_17)
       (pred_11 obj_24)
       (pred_11 obj_04)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_11 obj_26)
       (pred_11 obj_12)
       (pred_11 obj_32)
       (pred_11 obj_13)
       (pred_11 obj_06)
       (pred_11 obj_05)
       (pred_11 obj_28)
       (pred_11 obj_10)
       (pred_11 obj_14)
       (pred_11 obj_20)
       (pred_11 obj_08)

       (pred_3  obj_18 obj_23)
       (pred_3  obj_21 obj_22)
       (pred_3  obj_29 obj_16)
       (pred_3  obj_31 obj_16)
       (pred_12 obj_18 obj_09)
       (pred_12 obj_21 obj_03)
       (pred_12 obj_29 obj_11)
       (pred_12 obj_31 obj_14)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_12 obj_18 obj_04)
       (pred_12 obj_21 obj_11)
       (pred_12 obj_29 obj_27)
    ))
(:constraints
  (always (not (pred_8 obj_24)))
)
)

; plan
1. (op_3 obj_13 obj_06)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_06)
   goals met: 0 of 3
2. (op_3 obj_06 obj_05)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_05)
   goals met: 0 of 3
3. (op_3 obj_05 obj_26)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_26)
   goals met: 0 of 3
4. (op_3 obj_26 obj_07)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_07)
   goals met: 0 of 3
5. (op_3 obj_07 obj_04)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_04)
   goals met: 0 of 3
6. (op_3 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 0 of 3
7. (op_1 obj_03 obj_21)
   deleted: (pred_12 obj_21 obj_03) (pred_4)
   added: (pred_10 obj_21)
   goals met: 0 of 3
8. (op_3 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 0 of 3
9. (op_3 obj_02 obj_11)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_11)
   goals met: 0 of 3
10. (op_4 obj_11 obj_29 obj_21)
   deleted: (pred_10 obj_21) (pred_12 obj_29 obj_11)
   added: (pred_10 obj_29) (pred_12 obj_21 obj_11)
   goals met: 1 of 3
11. (op_5 obj_11 obj_27 obj_29 obj_16)
   deleted: (pred_2 obj_27)
   added: (pred_11 obj_27)
   goals met: 1 of 3
12. (op_3 obj_11 obj_27)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_27)
   goals met: 1 of 3
13. (op_2 obj_27 obj_29)
   deleted: (pred_10 obj_29)
   added: (pred_4) (pred_12 obj_29 obj_27)
   goals met: 2 of 3
14. (op_3 obj_27 obj_07)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_07)
   goals met: 2 of 3
15. (op_3 obj_07 obj_04)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_04)
   goals met: 2 of 3
16. (op_3 obj_04 obj_03)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_03)
   goals met: 2 of 3
17. (op_3 obj_03 obj_19)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_19)
   goals met: 2 of 3
18. (op_3 obj_19 obj_15)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_15)
   goals met: 2 of 3
19. (op_3 obj_15 obj_17)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_17)
   goals met: 2 of 3
20. (op_3 obj_17 obj_09)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_09)
   goals met: 2 of 3
21. (op_1 obj_09 obj_18)
   deleted: (pred_12 obj_18 obj_09) (pred_4)
   added: (pred_10 obj_18)
   goals met: 2 of 3
22. (op_3 obj_09 obj_17)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_17)
   goals met: 2 of 3
23. (op_3 obj_17 obj_15)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_15)
   goals met: 2 of 3
24. (op_3 obj_15 obj_19)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_19)
   goals met: 2 of 3
25. (op_3 obj_19 obj_03)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_03)
   goals met: 2 of 3
26. (op_3 obj_03 obj_04)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_04)
   goals met: 2 of 3
27. (op_2 obj_04 obj_18)
   deleted: (pred_10 obj_18)
   added: (pred_4) (pred_12 obj_18 obj_04)
   goals met: 3 of 3
